#### Terraform Validation & Plan Results
* Terraform Version 📎`1.4.6`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mazurerm_resource_group.logging_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-logging-rg][0m
[0m[1mazurerm_resource_group.app_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mdata.azurerm_managed_api.managed_api_arm: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-logic-rt001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-logic-nsg001][0m
[0m[1mazurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.KeyVault/vaults/mylogic-dev-vault001][0m
[0m[1mazurerm_service_plan.service_plan: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Web/serverfarms/mylogic-dev-asp001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001][0m
[0m[1mdata.azurerm_managed_api.managed_api_arm: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Web/locations/northeurope/managedApis/arm][0m
[0m[1mazurerm_storage_account.storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/mylogicdevstg001][0m
[0m[1mazapi_resource.subnet_logic_app: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001/subnets/LogicAppSubnet][0m
[0m[1mazurerm_log_analytics_workspace.log_analytics_workspace: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/mylogic-dev-log001][0m
[0m[1mazapi_resource.api_connection_arm: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Web/connections/mylogic-dev-api-arm001][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_log_analytics_workspace: Reading...[0m[0m
[0m[1mazurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-logging-rg/providers/Microsoft.Insights/components/mylogic-dev-appi001][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_log_analytics_workspace: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/mylogic-dev-log001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_log_analytics_workspace: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/mylogic-dev-log001|logAnalytics][0m
[0m[1mazapi_resource.subnet_services: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001/subnets/PeSubnet][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mazurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Network/privateEndpoints/mylogic-dev-vault001-pe][0m
[0m[1mazurerm_role_assignment.current_role_assignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.KeyVault/vaults/mylogic-dev-vault001/providers/Microsoft.Authorization/roleAssignments/4e1f29ae-8630-1edb-7a52-cadc6a148f03][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.KeyVault/vaults/mylogic-dev-vault001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.KeyVault/vaults/mylogic-dev-vault001|logAnalytics][0m
[0m[1mazapi_resource.storage_file_share: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/mylogicdevstg001/fileServices/default/shares/logicapp][0m
[0m[1mazurerm_storage_management_policy.storage_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/mylogicdevstg001/managementPolicies/default][0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Network/privateEndpoints/mylogicdevstg001-blob-pe][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/mylogicdevstg001|logAnalytics][0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_file: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Network/privateEndpoints/mylogicdevstg001-file-pe][0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_table: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Network/privateEndpoints/mylogicdevstg001-table-pe][0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_queue: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Network/privateEndpoints/mylogicdevstg001-queue-pe][0m
[0m[1mazurerm_key_vault_secret.key_vault_secret_sample: Refreshing state... [id=https://mylogic-dev-vault001.vault.azure.net/secrets/MySampleSecret/d6b5f467551f4f159f91ea36e36370af][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Reading...[0m[0m
[0m[1mazurerm_logic_app_standard.logic_app: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Web/sites/mylogic-dev-la001][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-logging-rg/providers/Microsoft.Insights/components/mylogic-dev-appi001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-logging-rg/providers/Microsoft.Insights/components/mylogic-dev-appi001|logAnalytics][0m
[0m[1mazurerm_role_assignment.logic_app_role_assignment_storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/mylogicdevstg001/providers/Microsoft.Authorization/roleAssignments/a7587a11-a631-5e54-0fb7-26c39d7400af][0m
[0m[1mazurerm_role_assignment.logic_app_role_assignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.KeyVault/vaults/mylogic-dev-vault001/providers/Microsoft.Authorization/roleAssignments/eecee61d-05a3-a5a2-696c-7fc3ded37d22][0m
[0m[1mazapi_resource.api_connection_arm_access_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Web/connections/mylogic-dev-api-arm001/accessPolicies/mylogic-dev-la001-9a6a5483-cc1f-43b8-a599-c73e9c4bd6cc][0m
[0m[1mazurerm_private_endpoint.logic_app_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Network/privateEndpoints/mylogic-dev-la001-pe][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_logic_app: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Web/sites/mylogic-dev-la001|logAnalytics][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_logic_app[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_logic_app" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m logs                = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Web/sites/mylogic-dev-la001"
    }

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_storage" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m logs                = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/mylogicdevstg001"
    }

[1m  # azurerm_logic_app_standard.logic_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_logic_app_standard" "logic_app" {
      [33m~[0m[0m app_service_plan_id            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Web/serverfarms/mylogic-dev-asp001" -> (known after apply)
        id                             = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Web/sites/mylogic-dev-la001"
        name                           = "mylogic-dev-la001"
        tags                           = {}
        [90m# (20 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m site_config {
          [33m~[0m[0m ip_restriction                   = [
              [31m-[0m[0m {
                  [31m-[0m[0m action                    = "Allow"
                  [31m-[0m[0m headers                   = []
                  [31m-[0m[0m ip_address                = "89.247.164.232/32"
                  [31m-[0m[0m name                      = "myip"
                  [31m-[0m[0m priority                  = 100
                  [31m-[0m[0m service_tag               = ""
                  [31m-[0m[0m virtual_network_subnet_id = ""
                },
            ]
          [33m~[0m[0m scm_ip_restriction               = [
              [31m-[0m[0m {
                  [31m-[0m[0m action                    = "Allow"
                  [31m-[0m[0m headers                   = []
                  [31m-[0m[0m ip_address                = "89.247.164.232/32"
                  [31m-[0m[0m name                      = "myip"
                  [31m-[0m[0m priority                  = 100
                  [31m-[0m[0m service_tag               = ""
                  [31m-[0m[0m virtual_network_subnet_id = ""
                },
            ]
            [90m# (15 unchanged attributes hidden)[0m[0m

            [90m# (1 unchanged block hidden)[0m[0m
        }

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_logic_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_logic_app" {
        id                         = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Web/sites/mylogic-dev-la001|logAnalytics"
        name                       = "logAnalytics"
        [90m# (2 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 30 [90m-> null[0m[0m
              [31m-[0m[0m enabled = true [90m-> null[0m[0m
            }
        }

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_storage[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_storage" {
        id                         = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/mylogicdevstg001|logAnalytics"
        name                       = "logAnalytics"
        [90m# (2 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m metric {
          [31m-[0m[0m category = "Capacity" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 30 [90m-> null[0m[0m
              [31m-[0m[0m enabled = true [90m-> null[0m[0m
            }
        }
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "Transaction" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 30 [90m-> null[0m[0m
              [31m-[0m[0m enabled = true [90m-> null[0m[0m
            }
        }
    }

[1m  # azurerm_service_plan.service_plan[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_service_plan" "service_plan" {
      [33m~[0m[0m id                           = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Web/serverfarms/mylogic-dev-asp001" -> (known after apply)
      [33m~[0m[0m kind                         = "elastic" -> (known after apply)
        name                         = "mylogic-dev-asp001"
      [33m~[0m[0m reserved                     = false -> (known after apply)
      [31m-[0m[0m tags                         = {} [90m-> null[0m[0m
      [33m~[0m[0m worker_count                 = 3 [33m->[0m[0m 1
      [33m~[0m[0m zone_balancing_enabled       = true [33m->[0m[0m false [31m# forces replacement[0m[0m
        [90m# (6 unchanged attributes hidden)[0m[0m
    }

[1m  # azurerm_storage_account.storage[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_storage_account" "storage" {
        id                                = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/mylogicdevstg001"
        name                              = "mylogicdevstg001"
      [33m~[0m[0m public_network_access_enabled     = true [33m->[0m[0m false
        tags                              = {}
        [90m# (38 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m network_rules {
          [33m~[0m[0m ip_rules                   = [
              [31m-[0m[0m "89.247.164.232",
            ]
            [90m# (3 unchanged attributes hidden)[0m[0m

          [31m-[0m[0m private_link_access {
              [31m-[0m[0m endpoint_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Security/datascanners/storageDataScanner" [90m-> null[0m[0m
              [31m-[0m[0m endpoint_tenant_id   = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e" [90m-> null[0m[0m
            }
        }

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m 1 to add, 4 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>